jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_CAPSENSE_A_Registers.h
//------------------------------------------------------------------------------
// Copyright (c) 2012 by Silicon Laboratories. 
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User 
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v10/License_Agreement_v10.htm
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//
// Script: 0.57
// Version: 1

#ifndef __SI32_CAPSENSE_A_REGISTERS_H__
#define __SI32_CAPSENSE_A_REGISTERS_H__

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

struct SI32_CAPSENSE_A_CONTROL_Struct
{
   union
   {
      struct
      {
         // Start and Busy Flag
         volatile uint32_t BUSYF: 1;
         // Module Enable
         volatile uint32_t CSEN: 1;
         // Bias Enable
         volatile uint32_t BIASEN: 1;
         // Digital Comparator Polarity Select
         volatile uint32_t CMPPOL: 1;
         // Conversion Mode Select
         volatile uint32_t CMD: 2;
         // Conversion Rate
         volatile uint32_t CNVR: 2;
         // Accumulator Mode Select
         volatile uint32_t ACCMD: 3;
         // Multiple Channel Enable
         volatile uint32_t MCEN: 1;
         // Start of Conversion Mode Select
         volatile uint32_t CSCM: 4;
         // Pin Monitor Mode
         volatile uint32_t PMMD: 2;
         // Pin Monitor Event Flag
         volatile uint32_t PMEF: 1;
                  uint32_t reserved0: 1;
         // Threshold Comparator Enable
         volatile uint32_t CMPEN: 1;
         // Conversion Done Interrupt Enable
         volatile uint32_t CDIEN: 1;
         // End-of-Scan Interrupt Enable
         volatile uint32_t EOSIEN: 1;
                  uint32_t reserved1: 1;
         // Threshold Comparator Interrupt Flag
         volatile uint32_t CMPI: 1;
         // Conversion Done Interrupt Flag
         volatile uint32_t CDI: 1;
         // End-of-Scan Interrupt Flag
         volatile uint32_t EOSI: 1;
                  uint32_t reserved2: 5;
      };
      volatile uint32_t U32;
   };
};

#define SI32_CAPSENSE_A_CONTROL_BUSYF_MASK  0x00000001
#define SI32_CAPSENSE_A_CONTROL_BUSYF_SHIFT  0
// Read: A capacitive sensing conversion is complete or a conversion is not
// currently in progress. Write: No effect.
#define SI32_CAPSENSE_A_CONTROL_BUSYF_IDLE_VALUE  0
#define SI32_CAPSENSE_A_CONTROL_BUSYF_IDLE_U32 \
   (SI32_CAPSENSE_A_CONTROL_BUSYF_IDLE_VALUE << SI32_CAPSENSE_A_CONTROL_BUSYF_SHIFT)
// Read: A capacitive sensing conversion is in progress. Write: Initiate a
// capacitive sensing conversion if BUSYF is selected as the start of conversion
// source.
#define SI32_CAPSENSE_A_CONTROL_BUSYF_BUSY_VALUE  1
#define SI32_CAPSENSE_A_CONTROL_BUSYF_BUSY_U32 \
   (SI32_CAPSENSE_A_CONTROL_BUSYF_BUSY_VALUE << SI32_CAPSENSE_A_CONTROL_BUSYF_SHIFT)

#define SI32_CAPSENSE_A_CONTROL_CSEN_MASK  0x00000002
#define SI32_CAPSENSE_A_CONTROL_CSEN_SHIFT  1
// Disable the capacitive sensing module.
#define SI32_CAPSENSE_A_CONTROL_CSEN_DISABLED_VALUE  0
#define SI32_CAPSENSE_A_CONTROL_CSEN_DISABLED_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSEN_DISABLED_VALUE << SI32_CAPSENSE_A_CONTROL_CSEN_SHIFT)
// Enable the capacitive sensing module.
#define SI32_CAPSENSE_A_CONTROL_CSEN_ENABLED_VALUE  1
#define SI32_CAPSENSE_A_CONTROL_CSEN_ENABLED_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSEN_ENABLED_VALUE << SI32_CAPSENSE_A_CONTROL_CSEN_SHIFT)

#define SI32_CAPSENSE_A_CONTROL_BIASEN_MASK  0x00000004
#define SI32_CAPSENSE_A_CONTROL_BIASEN_SHIFT  2
// Disable the bias.
#define SI32_CAPSENSE_A_CONTROL_BIASEN_DISABLED_VALUE  0
#define SI32_CAPSENSE_A_CONTROL_BIASEN_DISABLED_U32 \
   (SI32_CAPSENSE_A_CONTROL_BIASEN_DISABLED_VALUE << SI32_CAPSENSE_A_CONTROL_BIASEN_SHIFT)
// Enable the bias.
#define SI32_CAPSENSE_A_CONTROL_BIASEN_ENABLED_VALUE  1
#define SI32_CAPSENSE_A_CONTROL_BIASEN_ENABLED_U32 \
   (SI32_CAPSENSE_A_CONTROL_BIASEN_ENABLED_VALUE << SI32_CAPSENSE_A_CONTROL_BIASEN_SHIFT)

#define SI32_CAPSENSE_A_CONTROL_CMPPOL_MASK  0x00000008
#define SI32_CAPSENSE_A_CONTROL_CMPPOL_SHIFT  3
// The digital comparator generates an interrupt if the conversion is greater than
// the CSTH threshold.
#define SI32_CAPSENSE_A_CONTROL_CMPPOL_GT_VALUE  0
#define SI32_CAPSENSE_A_CONTROL_CMPPOL_GT_U32 \
   (SI32_CAPSENSE_A_CONTROL_CMPPOL_GT_VALUE << SI32_CAPSENSE_A_CONTROL_CMPPOL_SHIFT)
// The digital comparator generates an interrupt if the conversion is less than or
// equal to the CSTH threshold.
#define SI32_CAPSENSE_A_CONTROL_CMPPOL_LTE_VALUE  1
#define SI32_CAPSENSE_A_CONTROL_CMPPOL_LTE_U32 \
   (SI32_CAPSENSE_A_CONTROL_CMPPOL_LTE_VALUE << SI32_CAPSENSE_A_CONTROL_CMPPOL_SHIFT)

#define SI32_CAPSENSE_A_CONTROL_CMD_MASK  0x00000030
#define SI32_CAPSENSE_A_CONTROL_CMD_SHIFT  4
// Single Conversion Mode: One conversion occurs on a single channel.
#define SI32_CAPSENSE_A_CONTROL_CMD_SINGLE_VALUE  0
#define SI32_CAPSENSE_A_CONTROL_CMD_SINGLE_U32 \
   (SI32_CAPSENSE_A_CONTROL_CMD_SINGLE_VALUE << SI32_CAPSENSE_A_CONTROL_CMD_SHIFT)
// Single Scan Mode: One conversion on each channel selected by SCANEN occurs. An
// end-of-scan interrupt indicates all channels have been measured.
#define SI32_CAPSENSE_A_CONTROL_CMD_SCAN_VALUE  1
#define SI32_CAPSENSE_A_CONTROL_CMD_SCAN_U32 \
   (SI32_CAPSENSE_A_CONTROL_CMD_SCAN_VALUE << SI32_CAPSENSE_A_CONTROL_CMD_SHIFT)
// Continuous Single Conversion Mode: Continuously converts on a single channel.
// This operation ends only if the module is disabled (CSEN = 0) or if a compare
// threshold event occurs (CMPI = 1).
#define SI32_CAPSENSE_A_CONTROL_CMD_CONT_SINGLE_VALUE  2
#define SI32_CAPSENSE_A_CONTROL_CMD_CONT_SINGLE_U32 \
   (SI32_CAPSENSE_A_CONTROL_CMD_CONT_SINGLE_VALUE << SI32_CAPSENSE_A_CONTROL_CMD_SHIFT)
// Continuous Scan Mode: Continuously loops through and converts on all the
// channels selected by SCANEN. This operation ends only if the module is disabled
// (CSEN = 0) or if a compare threshold event occurs (CMPI = 1).
#define SI32_CAPSENSE_A_CONTROL_CMD_CONT_SCAN_VALUE  3
#define SI32_CAPSENSE_A_CONTROL_CMD_CONT_SCAN_U32 \
   (SI32_CAPSENSE_A_CONTROL_CMD_CONT_SCAN_VALUE << SI32_CAPSENSE_A_CONTROL_CMD_SHIFT)

#define SI32_CAPSENSE_A_CONTROL_CNVR_MASK  0x000000C0
#define SI32_CAPSENSE_A_CONTROL_CNVR_SHIFT  6
// Conversions last 12 internal CAPSENSE clocks and results are 12 bits in length.
#define SI32_CAPSENSE_A_CONTROL_CNVR_12BIT_VALUE  0
#define SI32_CAPSENSE_A_CONTROL_CNVR_12BIT_U32 \
   (SI32_CAPSENSE_A_CONTROL_CNVR_12BIT_VALUE << SI32_CAPSENSE_A_CONTROL_CNVR_SHIFT)
// Conversions last 13 internal CAPSENSE clocks and results are 13 bits in length.
#define SI32_CAPSENSE_A_CONTROL_CNVR_13BIT_VALUE  1
#define SI32_CAPSENSE_A_CONTROL_CNVR_13BIT_U32 \
   (SI32_CAPSENSE_A_CONTROL_CNVR_13BIT_VALUE << SI32_CAPSENSE_A_CONTROL_CNVR_SHIFT)
// Conversions last 14 internal CAPSENSE clocks and results are 14 bits in length.
#define SI32_CAPSENSE_A_CONTROL_CNVR_14BIT_VALUE  2
#define SI32_CAPSENSE_A_CONTROL_CNVR_14BIT_U32 \
   (SI32_CAPSENSE_A_CONTROL_CNVR_14BIT_VALUE << SI32_CAPSENSE_A_CONTROL_CNVR_SHIFT)
// Conversions last 16 internal CAPSENSE clocks and results are 16 bits in length.
#define SI32_CAPSENSE_A_CONTROL_CNVR_16BIT_VALUE  3
#define SI32_CAPSENSE_A_CONTROL_CNVR_16BIT_U32 \
   (SI32_CAPSENSE_A_CONTROL_CNVR_16BIT_VALUE << SI32_CAPSENSE_A_CONTROL_CNVR_SHIFT)

#define SI32_CAPSENSE_A_CONTROL_ACCMD_MASK  0x00000700
#define SI32_CAPSENSE_A_CONTROL_ACCMD_SHIFT  8
// Accumulate 1 sample.
#define SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_1_VALUE  0
#define SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_1_U32 \
   (SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_1_VALUE << SI32_CAPSENSE_A_CONTROL_ACCMD_SHIFT)
// Accumulate 4 samples.
#define SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_4_VALUE  1
#define SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_4_U32 \
   (SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_4_VALUE << SI32_CAPSENSE_A_CONTROL_ACCMD_SHIFT)
// Accumulate 8 samples.
#define SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_8_VALUE  2
#define SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_8_U32 \
   (SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_8_VALUE << SI32_CAPSENSE_A_CONTROL_ACCMD_SHIFT)
// Accumulate 16 samples.
#define SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_16_VALUE  3
#define SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_16_U32 \
   (SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_16_VALUE << SI32_CAPSENSE_A_CONTROL_ACCMD_SHIFT)
// Accumulate 32 samples.
#define SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_32_VALUE  4
#define SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_32_U32 \
   (SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_32_VALUE << SI32_CAPSENSE_A_CONTROL_ACCMD_SHIFT)
// Accumulate 64 samples.
#define SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_64_VALUE  5
#define SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_64_U32 \
   (SI32_CAPSENSE_A_CONTROL_ACCMD_ACC_64_VALUE << SI32_CAPSENSE_A_CONTROL_ACCMD_SHIFT)

