jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_CAPSENSE_A_Registers.h
#define SI32_CAPSENSE_A_CONTROL_MCEN_MASK  0x00000800
#define SI32_CAPSENSE_A_CONTROL_MCEN_SHIFT  11
// Disable the multiple channel measurement feature.
#define SI32_CAPSENSE_A_CONTROL_MCEN_DISABLED_VALUE  0
#define SI32_CAPSENSE_A_CONTROL_MCEN_DISABLED_U32 \
   (SI32_CAPSENSE_A_CONTROL_MCEN_DISABLED_VALUE << SI32_CAPSENSE_A_CONTROL_MCEN_SHIFT)
// Enable the multiple channel measurement feature.
#define SI32_CAPSENSE_A_CONTROL_MCEN_ENABLED_VALUE  1
#define SI32_CAPSENSE_A_CONTROL_MCEN_ENABLED_U32 \
   (SI32_CAPSENSE_A_CONTROL_MCEN_ENABLED_VALUE << SI32_CAPSENSE_A_CONTROL_MCEN_SHIFT)

#define SI32_CAPSENSE_A_CONTROL_CSCM_MASK  0x0000F000
#define SI32_CAPSENSE_A_CONTROL_CSCM_SHIFT  12
// The CSnT0 trigger source starts conversions.
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT0_VALUE  0
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT0_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSCM_CSNT0_VALUE << SI32_CAPSENSE_A_CONTROL_CSCM_SHIFT)
// The CSnT1 trigger source starts conversions.
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT1_VALUE  1
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT1_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSCM_CSNT1_VALUE << SI32_CAPSENSE_A_CONTROL_CSCM_SHIFT)
// The CSnT2 trigger source starts conversions.
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT2_VALUE  2
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT2_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSCM_CSNT2_VALUE << SI32_CAPSENSE_A_CONTROL_CSCM_SHIFT)
// The CSnT3 trigger source starts conversions.
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT3_VALUE  3
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT3_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSCM_CSNT3_VALUE << SI32_CAPSENSE_A_CONTROL_CSCM_SHIFT)
// The CSnT4 trigger source starts conversions.
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT4_VALUE  4
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT4_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSCM_CSNT4_VALUE << SI32_CAPSENSE_A_CONTROL_CSCM_SHIFT)
// The CSnT5 trigger source starts conversions.
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT5_VALUE  5
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT5_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSCM_CSNT5_VALUE << SI32_CAPSENSE_A_CONTROL_CSCM_SHIFT)
// The CSnT6 trigger source starts conversions.
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT6_VALUE  6
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT6_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSCM_CSNT6_VALUE << SI32_CAPSENSE_A_CONTROL_CSCM_SHIFT)
// The CSnT7 trigger source starts conversions.
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT7_VALUE  7
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT7_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSCM_CSNT7_VALUE << SI32_CAPSENSE_A_CONTROL_CSCM_SHIFT)
// The CSnT8 trigger source starts conversions.
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT8_VALUE  8
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT8_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSCM_CSNT8_VALUE << SI32_CAPSENSE_A_CONTROL_CSCM_SHIFT)
// The CSnT9 trigger source starts conversions.
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT9_VALUE  9
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT9_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSCM_CSNT9_VALUE << SI32_CAPSENSE_A_CONTROL_CSCM_SHIFT)
// The CSnT10 trigger source starts conversions.
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT10_VALUE  10
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT10_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSCM_CSNT10_VALUE << SI32_CAPSENSE_A_CONTROL_CSCM_SHIFT)
// The CSnT11 trigger source starts conversions.
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT11_VALUE  11
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT11_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSCM_CSNT11_VALUE << SI32_CAPSENSE_A_CONTROL_CSCM_SHIFT)
// The CSnT12 trigger source starts conversions.
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT12_VALUE  12
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT12_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSCM_CSNT12_VALUE << SI32_CAPSENSE_A_CONTROL_CSCM_SHIFT)
// The CSnT13 trigger source starts conversions.
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT13_VALUE  13
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT13_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSCM_CSNT13_VALUE << SI32_CAPSENSE_A_CONTROL_CSCM_SHIFT)
// The CSnT14 trigger source starts conversions.
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT14_VALUE  14
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT14_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSCM_CSNT14_VALUE << SI32_CAPSENSE_A_CONTROL_CSCM_SHIFT)
// The CSnT15 trigger source starts conversions.
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT15_VALUE  15
#define SI32_CAPSENSE_A_CONTROL_CSCM_CSNT15_U32 \
   (SI32_CAPSENSE_A_CONTROL_CSCM_CSNT15_VALUE << SI32_CAPSENSE_A_CONTROL_CSCM_SHIFT)

#define SI32_CAPSENSE_A_CONTROL_PMMD_MASK  0x00030000
#define SI32_CAPSENSE_A_CONTROL_PMMD_SHIFT  16
// Always retry on a pin state change.
#define SI32_CAPSENSE_A_CONTROL_PMMD_ALWAYS_RETRY_VALUE  0
#define SI32_CAPSENSE_A_CONTROL_PMMD_ALWAYS_RETRY_U32 \
   (SI32_CAPSENSE_A_CONTROL_PMMD_ALWAYS_RETRY_VALUE << SI32_CAPSENSE_A_CONTROL_PMMD_SHIFT)
// Retry up to twice on consecutive bit cycles.
#define SI32_CAPSENSE_A_CONTROL_PMMD_RETRY_TWICE_VALUE  1
#define SI32_CAPSENSE_A_CONTROL_PMMD_RETRY_TWICE_U32 \
   (SI32_CAPSENSE_A_CONTROL_PMMD_RETRY_TWICE_VALUE << SI32_CAPSENSE_A_CONTROL_PMMD_SHIFT)
// Retry up to four times on consecutive bit cycles.
#define SI32_CAPSENSE_A_CONTROL_PMMD_RETRY_FOUR_TIMES_VALUE  2
#define SI32_CAPSENSE_A_CONTROL_PMMD_RETRY_FOUR_TIMES_U32 \
   (SI32_CAPSENSE_A_CONTROL_PMMD_RETRY_FOUR_TIMES_VALUE << SI32_CAPSENSE_A_CONTROL_PMMD_SHIFT)
// Ignore monitored signal state change.
#define SI32_CAPSENSE_A_CONTROL_PMMD_DO_NOT_RETRY_VALUE  3
#define SI32_CAPSENSE_A_CONTROL_PMMD_DO_NOT_RETRY_U32 \
   (SI32_CAPSENSE_A_CONTROL_PMMD_DO_NOT_RETRY_VALUE << SI32_CAPSENSE_A_CONTROL_PMMD_SHIFT)

#define SI32_CAPSENSE_A_CONTROL_PMEF_MASK  0x00040000
#define SI32_CAPSENSE_A_CONTROL_PMEF_SHIFT  18
// A retry did not occur due to a pin monitor event during the last conversion.
#define SI32_CAPSENSE_A_CONTROL_PMEF_NOT_SET_VALUE  0
#define SI32_CAPSENSE_A_CONTROL_PMEF_NOT_SET_U32 \
   (SI32_CAPSENSE_A_CONTROL_PMEF_NOT_SET_VALUE << SI32_CAPSENSE_A_CONTROL_PMEF_SHIFT)
// A retry occurred due to a pin monitor event during the last conversion.
#define SI32_CAPSENSE_A_CONTROL_PMEF_SET_VALUE  1
#define SI32_CAPSENSE_A_CONTROL_PMEF_SET_U32 \
   (SI32_CAPSENSE_A_CONTROL_PMEF_SET_VALUE << SI32_CAPSENSE_A_CONTROL_PMEF_SHIFT)

