jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_CAPSENSE_A_Registers.h
#define SI32_CAPSENSE_A_CONTROL_CMPEN_MASK  0x00100000
#define SI32_CAPSENSE_A_CONTROL_CMPEN_SHIFT  20
// Disable the threshold comparator.
#define SI32_CAPSENSE_A_CONTROL_CMPEN_DISABLED_VALUE  0
#define SI32_CAPSENSE_A_CONTROL_CMPEN_DISABLED_U32 \
   (SI32_CAPSENSE_A_CONTROL_CMPEN_DISABLED_VALUE << SI32_CAPSENSE_A_CONTROL_CMPEN_SHIFT)
// Enable the threshold comparator.
#define SI32_CAPSENSE_A_CONTROL_CMPEN_ENABLED_VALUE  1
#define SI32_CAPSENSE_A_CONTROL_CMPEN_ENABLED_U32 \
   (SI32_CAPSENSE_A_CONTROL_CMPEN_ENABLED_VALUE << SI32_CAPSENSE_A_CONTROL_CMPEN_SHIFT)

#define SI32_CAPSENSE_A_CONTROL_CDIEN_MASK  0x00200000
#define SI32_CAPSENSE_A_CONTROL_CDIEN_SHIFT  21
// Disable the single conversion done interrupt.
#define SI32_CAPSENSE_A_CONTROL_CDIEN_DISABLED_VALUE  0
#define SI32_CAPSENSE_A_CONTROL_CDIEN_DISABLED_U32 \
   (SI32_CAPSENSE_A_CONTROL_CDIEN_DISABLED_VALUE << SI32_CAPSENSE_A_CONTROL_CDIEN_SHIFT)
// Enable the single conversion done interrupt.
#define SI32_CAPSENSE_A_CONTROL_CDIEN_ENABLED_VALUE  1
#define SI32_CAPSENSE_A_CONTROL_CDIEN_ENABLED_U32 \
   (SI32_CAPSENSE_A_CONTROL_CDIEN_ENABLED_VALUE << SI32_CAPSENSE_A_CONTROL_CDIEN_SHIFT)

#define SI32_CAPSENSE_A_CONTROL_EOSIEN_MASK  0x00400000
#define SI32_CAPSENSE_A_CONTROL_EOSIEN_SHIFT  22
// Disable the single scan end-of-scan interrupt.
#define SI32_CAPSENSE_A_CONTROL_EOSIEN_DISABLED_VALUE  0
#define SI32_CAPSENSE_A_CONTROL_EOSIEN_DISABLED_U32 \
   (SI32_CAPSENSE_A_CONTROL_EOSIEN_DISABLED_VALUE << SI32_CAPSENSE_A_CONTROL_EOSIEN_SHIFT)
// Enable the single scan end-of-scan interrupt.
#define SI32_CAPSENSE_A_CONTROL_EOSIEN_ENABLED_VALUE  1
#define SI32_CAPSENSE_A_CONTROL_EOSIEN_ENABLED_U32 \
   (SI32_CAPSENSE_A_CONTROL_EOSIEN_ENABLED_VALUE << SI32_CAPSENSE_A_CONTROL_EOSIEN_SHIFT)

#define SI32_CAPSENSE_A_CONTROL_CMPI_MASK  0x01000000
#define SI32_CAPSENSE_A_CONTROL_CMPI_SHIFT  24
// The capacitive sensing result did not cause a compare threshold interrupt.
#define SI32_CAPSENSE_A_CONTROL_CMPI_NOT_SET_VALUE  0
#define SI32_CAPSENSE_A_CONTROL_CMPI_NOT_SET_U32 \
   (SI32_CAPSENSE_A_CONTROL_CMPI_NOT_SET_VALUE << SI32_CAPSENSE_A_CONTROL_CMPI_SHIFT)
// The capacitive sensing result caused a compare threshold interrupt.
#define SI32_CAPSENSE_A_CONTROL_CMPI_SET_VALUE  1
#define SI32_CAPSENSE_A_CONTROL_CMPI_SET_U32 \
   (SI32_CAPSENSE_A_CONTROL_CMPI_SET_VALUE << SI32_CAPSENSE_A_CONTROL_CMPI_SHIFT)

#define SI32_CAPSENSE_A_CONTROL_CDI_MASK  0x02000000
#define SI32_CAPSENSE_A_CONTROL_CDI_SHIFT  25
// Read: The CAPSENSEn module has not completed a data conversion since the last
// time CDI was cleared. Write: Clear the interrupt.
#define SI32_CAPSENSE_A_CONTROL_CDI_NOT_SET_VALUE  0
#define SI32_CAPSENSE_A_CONTROL_CDI_NOT_SET_U32 \
   (SI32_CAPSENSE_A_CONTROL_CDI_NOT_SET_VALUE << SI32_CAPSENSE_A_CONTROL_CDI_SHIFT)
// Read: The CAPSENSEn module completed a data conversion. Write: Force a
// conversion complete interrupt.
#define SI32_CAPSENSE_A_CONTROL_CDI_SET_VALUE  1
#define SI32_CAPSENSE_A_CONTROL_CDI_SET_U32 \
   (SI32_CAPSENSE_A_CONTROL_CDI_SET_VALUE << SI32_CAPSENSE_A_CONTROL_CDI_SHIFT)

#define SI32_CAPSENSE_A_CONTROL_EOSI_MASK  0x04000000
#define SI32_CAPSENSE_A_CONTROL_EOSI_SHIFT  26
// The CAPSENSEn module has not completed a scan since the last time EOSI was
// cleared.
#define SI32_CAPSENSE_A_CONTROL_EOSI_NOT_SET_VALUE  0
#define SI32_CAPSENSE_A_CONTROL_EOSI_NOT_SET_U32 \
   (SI32_CAPSENSE_A_CONTROL_EOSI_NOT_SET_VALUE << SI32_CAPSENSE_A_CONTROL_EOSI_SHIFT)
// The CAPSENSEn module completed a scan.
#define SI32_CAPSENSE_A_CONTROL_EOSI_SET_VALUE  1
#define SI32_CAPSENSE_A_CONTROL_EOSI_SET_U32 \
   (SI32_CAPSENSE_A_CONTROL_EOSI_SET_VALUE << SI32_CAPSENSE_A_CONTROL_EOSI_SHIFT)



struct SI32_CAPSENSE_A_MODE_Struct
{
   union
   {
      struct
      {
         // Capacitance Gain Select
         volatile uint32_t CGSEL: 3;
                  uint32_t reserved0: 1;
         // Double Reset Select
         volatile uint32_t DRSEL: 2;
         // Ramp Selection
         volatile uint32_t RAMPSEL: 2;
         // Output Current Select
         volatile uint32_t IASEL: 3;
                  uint32_t reserved1: 1;
         // Discharge Time Select
         volatile uint32_t DTSEL: 3;
                  uint32_t reserved2: 1;
         // Low Pass Filter Select
         volatile uint32_t LPFSEL: 3;
                  uint32_t reserved3: 13;
      };
      volatile uint32_t U32;
   };
};

#define SI32_CAPSENSE_A_MODE_CGSEL_MASK  0x00000007
#define SI32_CAPSENSE_A_MODE_CGSEL_SHIFT  0

#define SI32_CAPSENSE_A_MODE_DRSEL_MASK  0x00000030
#define SI32_CAPSENSE_A_MODE_DRSEL_SHIFT  4

#define SI32_CAPSENSE_A_MODE_RAMPSEL_MASK  0x000000C0
#define SI32_CAPSENSE_A_MODE_RAMPSEL_SHIFT  6

#define SI32_CAPSENSE_A_MODE_IASEL_MASK  0x00000700
#define SI32_CAPSENSE_A_MODE_IASEL_SHIFT  8

#define SI32_CAPSENSE_A_MODE_DTSEL_MASK  0x00007000
#define SI32_CAPSENSE_A_MODE_DTSEL_SHIFT  12

#define SI32_CAPSENSE_A_MODE_LPFSEL_MASK  0x00070000
#define SI32_CAPSENSE_A_MODE_LPFSEL_SHIFT  16



struct SI32_CAPSENSE_A_DATA_Struct
{
   union
   {
      struct
      {
         // Capacitive Sensing Data
         volatile uint16_t DATA_BITS;
                  uint32_t reserved0: 16;
      };
      volatile uint32_t U32;
   };
};

#define SI32_CAPSENSE_A_DATA_DATA_MASK  0x0000FFFF
#define SI32_CAPSENSE_A_DATA_DATA_SHIFT  0



struct SI32_CAPSENSE_A_SCAN_Struct
{
   union
   {
      struct
      {
         // Channel Scan Enable
         volatile uint16_t SCANEN;
                  uint32_t reserved0: 16;
      };
      volatile uint32_t U32;
   };
};

#define SI32_CAPSENSE_A_SCAN_SCANEN_MASK  0x0000FFFF
#define SI32_CAPSENSE_A_SCAN_SCANEN_SHIFT  0



struct SI32_CAPSENSE_A_CSTH_Struct
{
   union
   {
      struct
      {
         // Compare Threshold
         volatile uint16_t CSTH_BITS;
                  uint32_t reserved0: 16;
      };
      volatile uint32_t U32;
   };
};

#define SI32_CAPSENSE_A_CSTH_CSTH_MASK  0x0000FFFF
#define SI32_CAPSENSE_A_CSTH_CSTH_SHIFT  0



struct SI32_CAPSENSE_A_MUX_Struct
{
   union
   {
      struct
      {
         // Mux Channel Select
         volatile uint32_t CSMX: 4;
                  uint32_t reserved0: 3;
         // Channel Disconnect
         volatile uint32_t CSDISC: 1;
                  uint32_t reserved1: 24;
      };
      volatile uint32_t U32;
   };
};

#define SI32_CAPSENSE_A_MUX_CSMX_MASK  0x0000000F
#define SI32_CAPSENSE_A_MUX_CSMX_SHIFT  0
// Select CSn.0.
#define SI32_CAPSENSE_A_MUX_CSMX_CSN0_VALUE  0
#define SI32_CAPSENSE_A_MUX_CSMX_CSN0_U32 \
   (SI32_CAPSENSE_A_MUX_CSMX_CSN0_VALUE << SI32_CAPSENSE_A_MUX_CSMX_SHIFT)
// Select CSn.1.
#define SI32_CAPSENSE_A_MUX_CSMX_CSN1_VALUE  1
#define SI32_CAPSENSE_A_MUX_CSMX_CSN1_U32 \
   (SI32_CAPSENSE_A_MUX_CSMX_CSN1_VALUE << SI32_CAPSENSE_A_MUX_CSMX_SHIFT)
// Select CSn.2.
#define SI32_CAPSENSE_A_MUX_CSMX_CSN2_VALUE  2
#define SI32_CAPSENSE_A_MUX_CSMX_CSN2_U32 \
   (SI32_CAPSENSE_A_MUX_CSMX_CSN2_VALUE << SI32_CAPSENSE_A_MUX_CSMX_SHIFT)
// Select CSn.3.
#define SI32_CAPSENSE_A_MUX_CSMX_CSN3_VALUE  3
#define SI32_CAPSENSE_A_MUX_CSMX_CSN3_U32 \
   (SI32_CAPSENSE_A_MUX_CSMX_CSN3_VALUE << SI32_CAPSENSE_A_MUX_CSMX_SHIFT)
// Select CSn.4.
#define SI32_CAPSENSE_A_MUX_CSMX_CSN4_VALUE  4
#define SI32_CAPSENSE_A_MUX_CSMX_CSN4_U32 \
   (SI32_CAPSENSE_A_MUX_CSMX_CSN4_VALUE << SI32_CAPSENSE_A_MUX_CSMX_SHIFT)
// Select CSn.5.
#define SI32_CAPSENSE_A_MUX_CSMX_CSN5_VALUE  5
#define SI32_CAPSENSE_A_MUX_CSMX_CSN5_U32 \
   (SI32_CAPSENSE_A_MUX_CSMX_CSN5_VALUE << SI32_CAPSENSE_A_MUX_CSMX_SHIFT)
// Select CSn.6.
#define SI32_CAPSENSE_A_MUX_CSMX_CSN6_VALUE  6
#define SI32_CAPSENSE_A_MUX_CSMX_CSN6_U32 \
   (SI32_CAPSENSE_A_MUX_CSMX_CSN6_VALUE << SI32_CAPSENSE_A_MUX_CSMX_SHIFT)
// Select CSn.7.
#define SI32_CAPSENSE_A_MUX_CSMX_CSN7_VALUE  7
#define SI32_CAPSENSE_A_MUX_CSMX_CSN7_U32 \
   (SI32_CAPSENSE_A_MUX_CSMX_CSN7_VALUE << SI32_CAPSENSE_A_MUX_CSMX_SHIFT)
// Select CSn.8.
#define SI32_CAPSENSE_A_MUX_CSMX_CSN8_VALUE  8
#define SI32_CAPSENSE_A_MUX_CSMX_CSN8_U32 \
   (SI32_CAPSENSE_A_MUX_CSMX_CSN8_VALUE << SI32_CAPSENSE_A_MUX_CSMX_SHIFT)
// Select CSn.9.
#define SI32_CAPSENSE_A_MUX_CSMX_CSN9_VALUE  9
#define SI32_CAPSENSE_A_MUX_CSMX_CSN9_U32 \
   (SI32_CAPSENSE_A_MUX_CSMX_CSN9_VALUE << SI32_CAPSENSE_A_MUX_CSMX_SHIFT)
// Select CSn.10.
#define SI32_CAPSENSE_A_MUX_CSMX_CSN10_VALUE  10
#define SI32_CAPSENSE_A_MUX_CSMX_CSN10_U32 \
   (SI32_CAPSENSE_A_MUX_CSMX_CSN10_VALUE << SI32_CAPSENSE_A_MUX_CSMX_SHIFT)
// Select CSn.11.
#define SI32_CAPSENSE_A_MUX_CSMX_CSN11_VALUE  11
#define SI32_CAPSENSE_A_MUX_CSMX_CSN11_U32 \
   (SI32_CAPSENSE_A_MUX_CSMX_CSN11_VALUE << SI32_CAPSENSE_A_MUX_CSMX_SHIFT)
// Select CSn.12.
#define SI32_CAPSENSE_A_MUX_CSMX_CSN12_VALUE  12
#define SI32_CAPSENSE_A_MUX_CSMX_CSN12_U32 \
   (SI32_CAPSENSE_A_MUX_CSMX_CSN12_VALUE << SI32_CAPSENSE_A_MUX_CSMX_SHIFT)
// Select CSn.13.
#define SI32_CAPSENSE_A_MUX_CSMX_CSN13_VALUE  13
#define SI32_CAPSENSE_A_MUX_CSMX_CSN13_U32 \
   (SI32_CAPSENSE_A_MUX_CSMX_CSN13_VALUE << SI32_CAPSENSE_A_MUX_CSMX_SHIFT)
// Select CSn.14.
#define SI32_CAPSENSE_A_MUX_CSMX_CSN14_VALUE  14
#define SI32_CAPSENSE_A_MUX_CSMX_CSN14_U32 \
   (SI32_CAPSENSE_A_MUX_CSMX_CSN14_VALUE << SI32_CAPSENSE_A_MUX_CSMX_SHIFT)
// Select CSn.15.
#define SI32_CAPSENSE_A_MUX_CSMX_CSN15_VALUE  15
#define SI32_CAPSENSE_A_MUX_CSMX_CSN15_U32 \
   (SI32_CAPSENSE_A_MUX_CSMX_CSN15_VALUE << SI32_CAPSENSE_A_MUX_CSMX_SHIFT)

#define SI32_CAPSENSE_A_MUX_CSDISC_MASK  0x00000080
#define SI32_CAPSENSE_A_MUX_CSDISC_SHIFT  7
// Connect the capacitive sensing circuit to the selected channel.
#define SI32_CAPSENSE_A_MUX_CSDISC_CONNECT_VALUE  0
#define SI32_CAPSENSE_A_MUX_CSDISC_CONNECT_U32 \
   (SI32_CAPSENSE_A_MUX_CSDISC_CONNECT_VALUE << SI32_CAPSENSE_A_MUX_CSDISC_SHIFT)
// Disconnect the capacitive sensing input channel.
#define SI32_CAPSENSE_A_MUX_CSDISC_DISCONNECT_VALUE  1
#define SI32_CAPSENSE_A_MUX_CSDISC_DISCONNECT_U32 \
   (SI32_CAPSENSE_A_MUX_CSDISC_DISCONNECT_VALUE << SI32_CAPSENSE_A_MUX_CSDISC_SHIFT)



typedef struct SI32_CAPSENSE_A_Struct
{
   struct SI32_CAPSENSE_A_CONTROL_Struct           CONTROL        ; // Base Address + 0x0
   volatile uint32_t                               CONTROL_SET;
   volatile uint32_t                               CONTROL_CLR;
   uint32_t                                        reserved0;
   struct SI32_CAPSENSE_A_MODE_Struct              MODE           ; // Base Address + 0x10
   volatile uint32_t                               MODE_SET;
   volatile uint32_t                               MODE_CLR;
   uint32_t                                        reserved1;
   struct SI32_CAPSENSE_A_DATA_Struct              DATA           ; // Base Address + 0x20
   uint32_t                                        reserved2;
   uint32_t                                        reserved3;
   uint32_t                                        reserved4;
   struct SI32_CAPSENSE_A_SCAN_Struct              SCAN           ; // Base Address + 0x30
   uint32_t                                        reserved5;
   uint32_t                                        reserved6;
   uint32_t                                        reserved7;
   struct SI32_CAPSENSE_A_CSTH_Struct              CSTH           ; // Base Address + 0x40
   uint32_t                                        reserved8;
   uint32_t                                        reserved9;
   uint32_t                                        reserved10;
   struct SI32_CAPSENSE_A_MUX_Struct               MUX            ; // Base Address + 0x50
   uint32_t                                        reserved11;
   uint32_t                                        reserved12;
   uint32_t                                        reserved13;
   uint32_t                                        reserved14[4];
   uint32_t                                        reserved15[4];
} SI32_CAPSENSE_A_Type;

#ifdef __cplusplus
}
#endif

#endif // __SI32_CAPSENSE_A_REGISTERS_H__

//-eof--------------------------------------------------------------------------

